read_verilog ../verilog/traditional_ab_mod_p_8.v
hierarchy -auto-top
proc
techmap
clean
stat

dfflibmap -liberty ./basic_cells.lib
abc -liberty ./basic_cells.lib
clean
stat

delete

read_verilog ../build/gf256_arith.v
hierarchy -top gf256_poly_mult_mastrovito
proc
techmap
clean
stat

dfflibmap -liberty ./basic_cells.lib
abc -liberty ./basic_cells.lib
clean
stat

delete
