
read_verilog galois.v tb.v
hierarchy -auto-top
#synth_ice40 -nobram
synth_ice40 
write_verilog tb.gate.v
